Revit 2024 API
CategorySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CategorySetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CategorySetIterator
Visual C++
public:
virtual CategorySetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
CategorySet Class
Autodesk.Revit.DB Namespace